Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: For the list of built-in cardinalities you can use, see [here](gmock_cheat_sheet.md#CardinalityList).
it_it: Per l'elenco delle cardinalità native utilizzabili, vedere [qui](gmock_cheat_sheet.md#CardinalityList).

source: For the purpose of typing, you can view
it_it: Ai fini della tipizzazione, è possibile visualizzare

source: For those cases, the framework provides the ::testing::RegisterTest that allows callers to register arbitrary tests dynamically.
it_it: Per questi casi, il framework fornisce ::testing::RegisterTest che consente ai chiamanti di registrare test arbitrari in modo dinamico.

source: For those cases, the framework provides the `::testing::RegisterTest` that allows callers to register arbitrary tests dynamically.
it_it: Per questi casi, il framework fornisce `::testing::RegisterTest` che consente ai chiamanti di registrare test arbitrari in modo dinamico.

source: Forcing a Verification
it_it: Forzare una Verifica

source: Fortunately, most of the time you can define a polymorphic matcher easily with the help of MakePolymorphicMatcher().
it_it: Fortunatamente, la maggior parte delle volte si può definire facilmente un matcher polimorfico con l'aiuto di MakePolymorphicMatcher().

source: Fortunately, most of the time you can define a polymorphic matcher easily with the help of `MakePolymorphicMatcher()`.
it_it: Fortunatamente, la maggior parte delle volte si può definire facilmente un matcher polimorfico con l'aiuto di `MakePolymorphicMatcher()`.

source: Fortunately, you learned about Dependency Injection and know the right thing to do: instead of having your application talk to the system API directly, wrap the API in an interface (say, Turtle) and code to that interface:
it_it: Fortunatamente, è nota la Dependency Injection e si conosce la cosa giusta da fare: anziché far dialogare l'applicazione direttamente con l'API di sistema, si avvolgono le API in un'interfaccia (ad esempio, Turtle) e il codice di tale interfaccia:

source: Fortunately, you learned about [Dependency Injection](https://en.wikipedia.org/wiki/Dependency_injection) and know the right thing to do: instead of having your application talk to the system API directly, wrap the API in an interface (say, `Turtle`) and code to that interface:
it_it: Fortunatamente, è nota la [Dependency Injection](https://en.wikipedia.org/wiki/Dependency_injection) e si conosce la cosa giusta da fare: anziché far dialogare l'applicazione direttamente con l'API di sistema, si avvolgono le API in un'interfaccia (ad esempio, `Turtle`) e il codice di tale interfaccia:

source: From that it should be obvious that the third EXPECT_CALL is written wrong.
it_it: Da ciò dovrebbe essere ovvio che il terzo EXPECT_CALL è scritto in modo errato.

source: From that it should be obvious that the third `EXPECT_CALL` is written wrong.
it_it: Da ciò dovrebbe essere ovvio che il terzo `EXPECT_CALL` è scritto in modo errato.

source: From that you can figure out which mock function it is, and how it is called.
it_it: Da ciò si può capire quale funzione mock è e come viene chiamata.

source: Functions
it_it: Funzioni

source: Functions are copyable, and are not usually passed around by pointer, which makes them tricky to mock.
it_it: Le funzioni sono copiabili e di solito non vengono passate tramite puntatore, il che le rende difficili da rendere mock.

source: Gaining Super Vision into Mock Calls
it_it: Ottenere la Supervisione nelle Chiamate Mock

source: General Syntax
it_it: Sintassi Generale

source: Generalized Assertion {#generalized}
it_it: Asserzione Generalizzata {#generalized}

source: Generally, you should not mock classes you don't own.
it_it: In generale, non si dovrebbero mock-are le classi altrui.

source: Generates a fatal failure, which returns from the current function.
it_it: Genera un errore fatale, che ritorna dalla funzione corrente.

source: Generates a nonfatal failure at the file and line number specified.
it_it: Genera un errore nonfatal nel file e nel numero di riga specificati.

source: Generates a nonfatal failure, which allows the current function to continue running.
it_it: Genera un errore nonfatal, che consente alla funzione corrente di continuare a funzionare.

source: Generates a success.
it_it: Genera un successo.

source: Generating Failures in Listeners
it_it: Generare Errori nei Listener

source: Generating a JSON Report
it_it: Generare un Report JSON

source: Generating an Extensible Markup Language (XML) report is as easy as passing a switch: --gtest_output="xml:<file name>".
it_it: Generare un report XML (Extensible Markup Language) è facile come passare un'opzione: --gtest_output="xml:<file name>".

source: Generating an XML Report
it_it: Generare un Report XML

source: Generic Comparison
it_it: Confronto Generico

source: Get Started
it_it: Iniziamo

source: Get the number of tests in this test suite that should run.
it_it: Ottiene il numero di test in questa test suite che dovrebbero essere eseguiti.

source: Gets the TestSuite object for the i-th test suite among all the test suites.
it_it: Ottiene l'oggetto TestSuite per la i-esima test suite tra tutte le test suite.

source: Gets the [`TestSuite`](#TestSuite) object for the `i`-th test suite among all the test suites.
it_it: Ottiene l'oggetto [`TestSuite`](#TestSuite) per la `i`-esima test suite tra tutte le test suite.

source: Gets the elapsed time, in milliseconds.
it_it: Ottiene il tempo trascorso, in millisecondi.

source: Gets the line in the source file where the test part took place, or -1 if it's unknown.
it_it: Ottiene la riga nel file sorgente in cui ha avuto luogo la parte di test o -1 se è sconosciuta.

source: Gets the line in the source file where the test part took place, or `-1` if it's unknown.
it_it: Ottiene la riga nel file sorgente in cui ha avuto luogo la parte di test o `-1` se è ignota.

source: Gets the message associated with the test part.
it_it: Ottiene il messaggio associato alla parte di test.

source: Gets the name of the source file where the test part took place, or NULL if it's unknown.
it_it: Ottiene il nome del file sorgente in cui ha avuto luogo la parte di test o NULL se è sconosciuto.

source: Gets the name of the source file where the test part took place, or `NULL` if it's unknown.
it_it: Ottiene il nome del file sorgente in cui ha avuto luogo la parte di test o `NULL` se è ignoto.

source: Gets the name of the test suite.
it_it: Prende il nome della test suite.

source: Gets the number of all test parts.
it_it: Ottiene il numero di tutte le parti di test.

source: Gets the number of all test suites that contain at least one test that should run.
it_it: Ottiene il numero di tutte le test suite che contengono almeno un test da eseguire.

source: Gets the number of all test suites.
it_it: Ottiene il numero di tutte le test suite.

source: Gets the number of all tests in this test suite.
it_it: Ottiene il numero di tutti i test in questa test suite.

source: Gets the number of all tests.
it_it: Ottiene il numero di tutti i test.

source: Gets the number of disabled tests in this test suite.
it_it: Ottiene il numero di test disabilitati in questa test suite.

source: Gets the number of disabled tests that will be reported in the XML report.
it_it: Ottiene il numero di test disabilitati che verranno riportati nel report XML.

source: Gets the number of disabled tests.
it_it: Ottiene il numero di test disabilitati.

source: Gets the number of failed test suites.
it_it: Ottiene il numero di test suite fallite.

source: Gets the number of failed tests in this test suite.
it_it: Ottiene il numero di test non riusciti in questa test suite.

source: Gets the number of failed tests.
it_it: Ottiene il numero di test falliti.

source: Gets the number of skipped tests in this test suite.
it_it: Ottiene il numero di test saltati [skip] in questa test suite.

source: Gets the number of skipped tests.
it_it: Ottiene il numero di test saltati [skip].

source: Gets the number of successful test suites.
it_it: Ottiene il numero di test suite riuscite.

source: Gets the number of successful tests in this test suite.
it_it: Ottiene il numero di test riusciti in questa test suite.

source: Gets the number of successful tests.
it_it: Ottiene il numero di test riusciti.

source: Gets the number of tests that should run.
it_it: Ottiene il numero di test da eseguire.

source: Gets the number of tests to be printed in the XML report.
it_it: Ottiene il numero di test da stampare nel report XML.

source: Gets the outcome of the test part.
it_it: Ottiene il risultato della parte di test.

source: Gets the singleton UnitTest object.
it_it: Ottiene l'oggetto singleton UnitTest.

source: Gets the singleton `UnitTest` object.
it_it: Ottiene l'oggetto singleton `UnitTest`.

source: Gets the summary of the failure message.
it_it: Ottiene il riepilogo del messaggio di errore.

source: Gets the time of the test case start, in ms from the start of the UNIX epoch.
it_it: Ottiene l'ora di inizio del test case, in ms dall'inizio della epoch UNIX.

source: Gets the time of the test program start, in ms from the start of the UNIX epoch.
it_it: Ottiene l'ora di inizio del programma di test, in ms dall'inizio della epoch UNIX.

source: Gets the time of the test suite start, in ms from the start of the UNIX epoch.
it_it: Ottiene l'ora di inizio della test suite, in ms dall'inizio della epoch UNIX.

source: Gets the user-supplied key.
it_it: Ottiene la chiave fornita dall'utente.

source: Gets the user-supplied value.
it_it: Ottiene il valore fornito dall'utente.

source: Getting Started
it_it: Iniziamo

source: Getting the Current Test's Name
it_it: Recuperare il Nome del Test Corrente

source: Given
it_it: Dato

source: Given Definition
it_it: Definizione Data

source: Global Set-Up and Tear-Down
it_it: Set-Up e Tear-Down Globali

source: Global variables pollute the global namespace.
it_it: Le variabili globali inquinano il namespace globale.

source: Good for you!
it_it: Una cosa buona!

source: Google Test implements the premature-exit-file protocol for test runners to catch any kind of unexpected exits of test programs.
it_it: Google Test implementa il protocollo premature-exit-file per consentire ai test runner di rilevare qualsiasi tipo di uscita imprevista dei programmi di test.

source: Google Test implements the _premature-exit-file_ protocol for test runners to catch any kind of unexpected exits of test programs.
it_it: Google Test implementa il protocollo _premature-exit-file_ per consentire ai test runner di rilevare qualsiasi tipo di uscita imprevista dei programmi di test.

source: Google Test is designed to be thread-safe.
it_it: Google Test è progettato per essere thread-safe.

source: Google has a lot of code that is platform-neutral; its tests should also be platform-neutral.
it_it: Google possieme molto codice indipendente dalla piattaforma; anche i suoi test dovrebbero anche essere indipendenti dalla piattaforma.

source: Google lets you run tests that are otherwise disabled
it_it: Google consente di eseguire test che altrimenti sarebbero disabilitati

source: Google provides an interesting and easy-to-use open source alternative for developing unit tests to validate C/C++ based software.
it_it: Google fornisce un'alternativa open source interessante e facile da usare per lo sviluppo di unit test per convalidare software basato su C/C++.

source: Google provides the macros shown in Listing 9 for floating point comparisons.
it_it: Google fornisce le macro mostrate nel Listato 9 per i confronti in virgola mobile.

source: Google provides the predefined predicate ::testing::ExitedWithCode(exit_code).
it_it: Google fornisce il predicato predefinito ::testing::ExitedWithCode(exit_code).

source: Google warns user of disabled tests in the framework
it_it: Google avvisa l'utente dei test disabilitati nel framework

source: Google's test framework provides excellent support for handling such situations.
it_it: Il framework di test di Google fornisce un eccellente supporto per gestire tali situazioni.

source: GoogleTest works on different OSes, with different compilers, with or without exceptions, so GoogleTest tests can work with a variety of configurations.
it_it: GoogleTest funziona su diversi sistemi operativi, con vari compilatori, con o senza eccezioni, quindi i test di GoogleTest possono funzionare con una varietà di configurazioni.

source: GoogleTest FAQ
it_it: FAQ di GoogleTest

source: GoogleTest Primer
it_it: Guida di GoogleTest

source: GoogleTest Term
it_it: Termine GoogleTest

source: GoogleTest User's Guide
it_it: Guida Utente di GoogleTest

source: GoogleTest allows the user to filter the tests by their full names.
it_it: GoogleTest consente all'utente di filtrare i test in base al nome completo.

source: GoogleTest also provides assertions that use a default error bound based on Units in the Last Place (ULPs).
it_it: GoogleTest fornisce inoltre asserzioni che utilizzano un limite di errore predefinito basato sulle Unità nell'Ultimo Posto [Units in the Last Place] (ULP).

source: GoogleTest assertions are macros that resemble function calls.
it_it: Le asserzioni di GoogleTest sono macro che assomigliano alle chiamate alle funzioni.

source: GoogleTest assumes ownership of the listener (i.e. it will delete the listener when the test program finishes).
it_it: GoogleTest assume la proprietà [owner] del listener (ovvero eliminerà il listener al termine del programma di test).

source: GoogleTest automatically calls SetUpTestSuite() before running the first test in the FooTest test suite (i.e. before creating the first FooTest object), and calls TearDownTestSuite() after running the last test in it (i.e. after deleting the last FooTest object).
it_it: GoogleTest chiama automaticamente SetUpTestSuite() prima di eseguire il primo test nella test suite FooTest (ovvero prima di creare il primo oggetto FooTest) e chiama TearDownTestSuite() dopo aver eseguito l'ultimo test al suo interno (ovvero dopo aver eliminato l'ultimo oggetto FooTest).

source: GoogleTest automatically calls `SetUpTestSuite()` before running the *first test* in the `FooTest` test suite (i.e. before creating the first `FooTest` object), and calls `TearDownTestSuite()` after running the *last test* in it (i.e. after deleting the last `FooTest` object).
it_it: GoogleTest chiama automaticamente `SetUpTestSuite()` prima di eseguire il *primo test* nella test suite `FooTest` (ovvero prima di creare il primo oggetto `FooTest`) e chiama `TearDownTestSuite()` dopo aver eseguito l'*ultimo test* al suo interno (ovvero dopo aver eliminato l'ultimo oggetto `FooTest`).

source: GoogleTest automatically keeps track of all tests defined, and doesn't require the user to enumerate them in order to run them.
it_it: GoogleTest tiene traccia automaticamente di tutti i test definiti e non richiede all'utente di elencarli per eseguirli.

source: GoogleTest calls SetUpTestSuite() before running the first test in the test suite.
it_it: GoogleTest chiama SetUpTestSuite() prima di eseguire il primo test nella test suite.

source: GoogleTest calls TearDownTestSuite() after running the last test in the test suite.
it_it: GoogleTest chiama TearDownTestSuite() dopo aver eseguito l'ultimo test nella test suite.

source: GoogleTest calls SetUp() before running each individual test.
it_it: GoogleTest chiama SetUp() prima di eseguire ciascun test.

source: GoogleTest calls TearDown() after running each individual test.
it_it: GoogleTest chiama TearDown() dopo l'esecuzione di ciascun singolo test.

source: GoogleTest calls `SetUp()` before running each individual test.
it_it: GoogleTest chiama `SetUp()` prima di eseguire ciascun test.

source: GoogleTest calls `SetUpTestSuite()` before running the first test in the test suite.
it_it: GoogleTest chiama `SetUpTestSuite()` prima di eseguire il primo test nella test suite.

source: GoogleTest calls `TearDown()` after running each individual test.
it_it: GoogleTest chiama `TearDown()` dopo l'esecuzione di ciascun singolo test.

source: GoogleTest calls `TearDownTestSuite()` after running the last test in the test suite.
it_it: GoogleTest chiama `TearDownTestSuite()` dopo aver eseguito l'ultimo test nella test suite.

source: GoogleTest can also emit a JSON report as an alternative format to XML.
it_it: GoogleTest può anche emettere un report JSON come formato alternativo a XML.

source: GoogleTest can be used either with or without exceptions enabled.
it_it: GoogleTest può essere utilizzato con o senza eccezioni abilitate.

source: GoogleTest can emit a detailed XML report to a file in addition to its normal textual output.
it_it: GoogleTest può emettere un report XML dettagliato in un file, oltre al normale output testuale.

source: GoogleTest can use colors in its terminal output to make it easier to spot the important information:
it_it: GoogleTest può utilizzare i colori nell'output del terminale per facilitare l'individuazione delle informazioni importanti:

source: GoogleTest comes with pkg-config files that can be used to determine all necessary flags for compiling and linking to GoogleTest (and GoogleMock).
it_it: GoogleTest viene fornito con file pkg-config utilizzabili per determinare tutti i flag necessari per la compilazione e il link a GoogleTest (e a GoogleMock).

source: GoogleTest constructs a QueueTest object (let's call it t1).
it_it: GoogleTest costruisce un oggetto QueueTest (chiamiamolo t1).

source: GoogleTest constructs a `QueueTest` object (let's call it `t1`).
it_it: GoogleTest costruisce un oggetto `QueueTest` (chiamiamolo `t1`).

source: GoogleTest creates a new test fixture object for each test in order to make tests independent and easier to debug.
it_it: GoogleTest crea un nuovo oggetto fixture per ogni test per rendere i test indipendenti e più facili da debuggare.

source: GoogleTest defines a number of functions for generating test parameters—see details at INSTANTIATE_TEST_SUITE_P in the Testing Reference.
it_it: GoogleTest definisce una serie di funzioni per la generazione di parametri di test: vedere i dettagli in INSTANTIATE_TEST_SUITE_P nel "Riferimento al Testing".

source: GoogleTest defines a number of functions for generating test parameters—see details at [`INSTANTIATE_TEST_SUITE_P`](reference/testing.md#INSTANTIATE_TEST_SUITE_P) in the Testing Reference.
it_it: GoogleTest definisce una serie di funzioni per la generazione di parametri di test: vedere i dettagli in [`INSTANTIATE_TEST_SUITE_P`](reference/testing.md#INSTANTIATE_TEST_SUITE_P) nel "Riferimento al Testing".

source: GoogleTest defines the following classes and types to help with writing tests.
it_it: GoogleTest definisce le seguenti classi e tipi per facilitare la scrittura dei test.

source: GoogleTest defines the following classes for working with mocks.
it_it: GoogleTest definisce le seguenti classi per lavorare con i mock.

source: GoogleTest defines the following functions to help with writing and running tests.
it_it: GoogleTest definisce le seguenti funzioni per facilitare la scrittura e l'esecuzione dei test.

source: GoogleTest defines the following macros for working with mocks.
it_it: GoogleTest definisce le seguenti macro per lavorare con i mock.

source: GoogleTest defines the following macros for writing tests.
it_it: GoogleTest definisce le seguenti macro per scrivere i test.

source: GoogleTest does **not** reuse the same test fixture for multiple tests.
it_it: GoogleTest **non** riutilizza la stessa fixture per più test.

source: GoogleTest does not reuse the same test fixture for multiple tests.
it_it: GoogleTest non riutilizza la stessa fixture per più test.

source: GoogleTest does not interleave tests from different test suites.
it_it: GoogleTest non intercala test di diverse test suite.

source: GoogleTest does this because it needs to set up a test suite before the first test in it is run, and tear it down afterwards.
it_it: GoogleTest fa questo perché deve impostare una test suite prima che venga eseguito il primo test al suo interno ed eseguirne il "tear down" successivamente.

source: GoogleTest doesn't stop at the first test failure.
it_it: GoogleTest non si ferma al primo fallimento del test.

source: GoogleTest follows Google's Foundational C++ Support Policy.
it_it: GoogleTest segue le Foundational C++ Support Policy di Google.

source: GoogleTest follows Google's [Foundational C++ Support Policy](https://opensource.google/documentation/policies/cplusplus-support).
it_it: GoogleTest segue le [Foundational C++ Support Policy](https://opensource.google/documentation/policies/cplusplus-support) di Google.

source: GoogleTest gives you three different options to solve this problem:
it_it: GoogleTest offre tre diverse opzioni per risolvere questo problema:

source: GoogleTest groups related tests into test suites that can share data and subroutines.
it_it: GoogleTest raggruppa i test correlati in suite di test che possono condividere dati e subroutine.

source: GoogleTest groups the test results by test suites, so logically related tests should be in the same test suite; in other words, the first argument to their TEST() should be the same.
it_it: GoogleTest raggruppa i risultati dei test per "test suite", quindi i test logicamente correlati dovrebbero trovarsi nella stessa test suite; in altre parole, il primo argomento del loro TEST() dovrebbe essere lo stesso.

source: GoogleTest groups the test results by test suites, so logically related tests should be in the same test suite; in other words, the first argument to their `TEST()` should be the same.
it_it: GoogleTest raggruppa i risultati dei test per "test suite", quindi i test logicamente correlati dovrebbero trovarsi nella stessa test suite; in altre parole, il primo argomento del loro `TEST()` dovrebbe essere lo stesso.

source: GoogleTest has no limit on how deep the hierarchy can be.
it_it: GoogleTest non ha limiti sulla profondità della gerarchia.

source: GoogleTest has three features intended to raise awareness of threading issues.
it_it: GoogleTest ha tre funzionalità destinate ad aumentare la consapevolezza sui problemi di threading.

source: GoogleTest is Google's C++ testing and mocking framework.
it_it: GoogleTest è il framework di test e mocking C++ di Google.

source: GoogleTest is a testing framework developed by the Testing Technology team with Google's specific requirements and constraints in mind.
it_it: GoogleTest è un framework per i test sviluppato dal team "Testing Technology" tenendo presenti i requisiti e i vincoli specifici di Google.

source: GoogleTest is compatible with test sharding.
it_it: GoogleTest è compatibile con lo sharding dei test.

source: GoogleTest isolates the tests by running each of them on a different object.
it_it: GoogleTest isola i test eseguendo ciascuno di essi su un oggetto diverso.

source: GoogleTest needs to be able to create objects of your test fixture class, so it must have a default constructor.
it_it: GoogleTest deve essere in grado di creare oggetti della classe fixture, quindi deve avere un costruttore di default.

source: GoogleTest output is buried in a whole bunch of LOG messages.
it_it: L'output di GoogleTest è sepolto in un sacco di messaggi di LOG.

source: GoogleTest passes all of the arguments as one tuple into the matcher.
it_it: GoogleTest passa tutti gli argomenti come una tupla al matcher.

source: GoogleTest prints the LOG messages in a death test's child process only when the test fails.
it_it: GoogleTest stampa i messaggi di LOG nel processo figlio di un death test solo quando il test fallisce.

source: GoogleTest provides assertions that you use to test the behavior of your code.
it_it: GoogleTest fornisce asserzioni utilizzate per testare il comportamento del codice.
